0x01-challenge/blog/app/controllers/posts_controller.rb

  def index
    @posts = Post.where(:status => true).all.order('created_at DESC')
---
SELECT "posts".* FROM "posts" WHERE "posts"."status" = ? ORDER BY created_at DESC  [["status", 1]]

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)  [["title", "Prueba 2"], ["body", "Hola amiguitos"], ["created_at", 2020-05-21 18:15:41.873113959 UTC], ["updated_at", 2020-05-21 18:15:41.873113959 UTC], ["status", 0]]

  def update
    @post = Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :body, :status))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "80% of batch 01 students are already working in the tech industry as software engineers. WOOT"], ["updated_at", 2020-05-21 17:35:07.979888041 UTC], ["id", 2]]